# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of `JOIN` statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
* Write SQL queries that make use of various types of joins
* Compare and contrast the various types of joins
* Discuss how primary and foreign keys are used in SQL
* Decide and perform whichever type of join is best for retrieving desired data

## CRM Schema

In almost all cases, rather than just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins** using shared columns from the two tables. 

In this lab, you'll use the same customer relationship management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database `'data.sqlite'`.

In [11]:
# Your code here
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Display the names of all the employees in Boston 

Hint: join the employees and offices tables.

In [13]:
# Your code here
cur.execute('''SELECT firstName, lastName
               FROM employees
               JOIN offices
               USING(officeCode)
               WHERE city = 'Boston';
                ''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

  firstName   lastName
0     Julie   Firrelli
1     Steve  Patterson

## Are there any offices that have zero employees?
Hint: Combine the employees and offices tables and use a group by.

In [21]:
# Your code here
cur.execute('''SELECT o.officeCode, o.city, COUNT(e.employeeNumber) AS n_employees
               FROM offices AS o
               LEFT JOIN employees AS e
               USING(officeCode)
               GROUP BY employeeNumber;
                ''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

   officeCode    city  n_employees
0          27  Boston            0

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary
# Example: Display the htmlDescription and employee's first and last name for each product that each employee has sold

In [25]:
# Your code here
# Display customer first and last name per order
cur.execute('''SELECT c.contactFirstName, c.contactLastName, o.orderNumber
               FROM orders AS o
               JOIN customers AS c
               USING(customerNumber);
                ''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

    contactFirstName contactLastName  orderNumber
0            Dorothy           Young        10100
1             Roland          Keitel        10101
2            Michael           Frick        10102
3             Jonas       Bergulfsen        10103
4             Diego           Freyre        10104
..               ...             ...          ...
321            Susan          Nelson        10421
322           Kelvin           Leong        10422
323       Catherine            Dewey        10423
324           Diego           Freyre        10424
325          Janine          Labrune        10425

[326 rows x 3 columns]

In [27]:
# Your code here
# Find payment dates and amounts per customer name
cur.execute('''SELECT c.customerName, p.paymentDate, p.Amount
               FROM payments AS p
               JOIN customers AS c
               USING(customerNumber);
                ''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

             customerName paymentDate    amount
0       Atelier graphique  2004-10-19   6066.78
1       Atelier graphique  2003-06-05  14571.44
2       Atelier graphique  2004-12-18   1676.14
3      Signal Gift Stores  2004-12-17  14191.12
4      Signal Gift Stores  2003-06-06  32641.98
..                    ...         ...       ...
268  Diecast Collectables  2003-12-26  59265.14
269  Diecast Collectables  2004-05-14   6276.60
270     Kelly's Gift Shop  2005-05-25  30253.75
271     Kelly's Gift Shop  2003-07-16  32077.44
272     Kelly's Gift Shop  2004-12-31  52166.00

[273 rows x 3 columns]

In [ ]:
# Your code here

## Level Up: Display the names of every individual product that each employee has sold

In [ ]:
# Your code here

## Level Up: Display the Number of Products each employee has sold

In [ ]:
# Your code here

## Summary

Congrats! You practiced using join statements and leveraged your foreign keys knowledge!